IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_PWMXBAR_CONTROLSS_PWMXBAR.xml
<module name="CONTROLSS_PWMXBAR_CONTROLSS_PWMXBAR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_PWMXBAR_PID" acronym="CONTROLSS_PWMXBAR_PID" offset="0x0" width="32" description="">
		<bitfield id="PID_MSB16" width="16" begin="31" end="16" resetval="0x24960" description="Not Defined" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="PID_MISC" width="5" begin="15" end="11" resetval="0x0" description="Not Defined" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="PID_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="Not Defined" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="PID_CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Not Defined" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="PID_MINOR" width="6" begin="5" end="0" resetval="0x20" description="Not Defined" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR_STATUS" acronym="CONTROLSS_PWMXBAR_PWMXBAR_STATUS" offset="0x10" width="32" description="">
		<bitfield id="STS" width="30" begin="29" end="0" resetval="0x0" description="Output Signal Status" range="29 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR_FLAGINVERT" acronym="CONTROLSS_PWMXBAR_PWMXBAR_FLAGINVERT" offset="0x14" width="32" description="">
		<bitfield id="INVERT" width="30" begin="29" end="0" resetval="0x0" description="Output Signal Invert Before Latch" range="29 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR_FLAG" acronym="CONTROLSS_PWMXBAR_PWMXBAR_FLAG" offset="0x18" width="32" description="">
		<bitfield id="BIT29" width="1" begin="29" end="29" resetval="0x0" description="Output Signal Latched Flag" range="29" rwaccess="RW"/> 
		<bitfield id="BIT28" width="1" begin="28" end="28" resetval="0x0" description="Output Signal Latched Flag" range="28" rwaccess="RW"/> 
		<bitfield id="BIT27" width="1" begin="27" end="27" resetval="0x0" description="Output Signal Latched Flag" range="27" rwaccess="RW"/> 
		<bitfield id="BIT26" width="1" begin="26" end="26" resetval="0x0" description="Output Signal Latched Flag" range="26" rwaccess="RW"/> 
		<bitfield id="BIT25" width="1" begin="25" end="25" resetval="0x0" description="Output Signal Latched Flag" range="25" rwaccess="RW"/> 
		<bitfield id="BIT24" width="1" begin="24" end="24" resetval="0x0" description="Output Signal Latched Flag" range="24" rwaccess="RW"/> 
		<bitfield id="BIT23" width="1" begin="23" end="23" resetval="0x0" description="Output Signal Latched Flag" range="23" rwaccess="RW"/> 
		<bitfield id="BIT22" width="1" begin="22" end="22" resetval="0x0" description="Output Signal Latched Flag" range="22" rwaccess="RW"/> 
		<bitfield id="BIT21" width="1" begin="21" end="21" resetval="0x0" description="Output Signal Latched Flag" range="21" rwaccess="RW"/> 
		<bitfield id="BIT20" width="1" begin="20" end="20" resetval="0x0" description="Output Signal Latched Flag" range="20" rwaccess="RW"/> 
		<bitfield id="BIT19" width="1" begin="19" end="19" resetval="0x0" description="Output Signal Latched Flag" range="19" rwaccess="RW"/> 
		<bitfield id="BIT18" width="1" begin="18" end="18" resetval="0x0" description="Output Signal Latched Flag" range="18" rwaccess="RW"/> 
		<bitfield id="BIT17" width="1" begin="17" end="17" resetval="0x0" description="Output Signal Latched Flag" range="17" rwaccess="RW"/> 
		<bitfield id="BIT16" width="1" begin="16" end="16" resetval="0x0" description="Output Signal Latched Flag" range="16" rwaccess="RW"/> 
		<bitfield id="BIT15" width="1" begin="15" end="15" resetval="0x0" description="Output Signal Latched Flag" range="15" rwaccess="RW"/> 
		<bitfield id="BIT14" width="1" begin="14" end="14" resetval="0x0" description="Output Signal Latched Flag" range="14" rwaccess="RW"/> 
		<bitfield id="BIT13" width="1" begin="13" end="13" resetval="0x0" description="Output Signal Latched Flag" range="13" rwaccess="RW"/> 
		<bitfield id="BIT12" width="1" begin="12" end="12" resetval="0x0" description="Output Signal Latched Flag" range="12" rwaccess="RW"/> 
		<bitfield id="BIT11" width="1" begin="11" end="11" resetval="0x0" description="Output Signal Latched Flag" range="11" rwaccess="RW"/> 
		<bitfield id="BIT10" width="1" begin="10" end="10" resetval="0x0" description="Output Signal Latched Flag" range="10" rwaccess="RW"/> 
		<bitfield id="BIT9" width="1" begin="9" end="9" resetval="0x0" description="Output Signal Latched Flag" range="9" rwaccess="RW"/> 
		<bitfield id="BIT8" width="1" begin="8" end="8" resetval="0x0" description="Output Signal Latched Flag" range="8" rwaccess="RW"/> 
		<bitfield id="BIT7" width="1" begin="7" end="7" resetval="0x0" description="Output Signal Latched Flag" range="7" rwaccess="RW"/> 
		<bitfield id="BIT6" width="1" begin="6" end="6" resetval="0x0" description="Output Signal Latched Flag" range="6" rwaccess="RW"/> 
		<bitfield id="BIT5" width="1" begin="5" end="5" resetval="0x0" description="Output Signal Latched Flag" range="5" rwaccess="RW"/> 
		<bitfield id="BIT4" width="1" begin="4" end="4" resetval="0x0" description="Output Signal Latched Flag" range="4" rwaccess="RW"/> 
		<bitfield id="BIT3" width="1" begin="3" end="3" resetval="0x0" description="Output Signal Latched Flag" range="3" rwaccess="RW"/> 
		<bitfield id="BIT2" width="1" begin="2" end="2" resetval="0x0" description="Output Signal Latched Flag" range="2" rwaccess="RW"/> 
		<bitfield id="BIT1" width="1" begin="1" end="1" resetval="0x0" description="Output Signal Latched Flag" range="1" rwaccess="RW"/> 
		<bitfield id="BIT0" width="1" begin="0" end="0" resetval="0x0" description="Output Signal Latched Flag" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR_FLAG_CLR" acronym="CONTROLSS_PWMXBAR_PWMXBAR_FLAG_CLR" offset="0x1C" width="32" description="">
		<bitfield id="BIT29" width="1" begin="29" end="29" resetval="0x0" description="Output Signal Latched Flag Clear" range="29" rwaccess="RW"/> 
		<bitfield id="BIT28" width="1" begin="28" end="28" resetval="0x0" description="Output Signal Latched Flag Clear" range="28" rwaccess="RW"/> 
		<bitfield id="BIT27" width="1" begin="27" end="27" resetval="0x0" description="Output Signal Latched Flag Clear" range="27" rwaccess="RW"/> 
		<bitfield id="BIT26" width="1" begin="26" end="26" resetval="0x0" description="Output Signal Latched Flag Clear" range="26" rwaccess="RW"/> 
		<bitfield id="BIT25" width="1" begin="25" end="25" resetval="0x0" description="Output Signal Latched Flag Clear" range="25" rwaccess="RW"/> 
		<bitfield id="BIT24" width="1" begin="24" end="24" resetval="0x0" description="Output Signal Latched Flag Clear" range="24" rwaccess="RW"/> 
		<bitfield id="BIT23" width="1" begin="23" end="23" resetval="0x0" description="Output Signal Latched Flag Clear" range="23" rwaccess="RW"/> 
		<bitfield id="BIT22" width="1" begin="22" end="22" resetval="0x0" description="Output Signal Latched Flag Clear" range="22" rwaccess="RW"/> 
		<bitfield id="BIT21" width="1" begin="21" end="21" resetval="0x0" description="Output Signal Latched Flag Clear" range="21" rwaccess="RW"/> 
		<bitfield id="BIT20" width="1" begin="20" end="20" resetval="0x0" description="Output Signal Latched Flag Clear" range="20" rwaccess="RW"/> 
		<bitfield id="BIT19" width="1" begin="19" end="19" resetval="0x0" description="Output Signal Latched Flag Clear" range="19" rwaccess="RW"/> 
		<bitfield id="BIT18" width="1" begin="18" end="18" resetval="0x0" description="Output Signal Latched Flag Clear" range="18" rwaccess="RW"/> 
		<bitfield id="BIT17" width="1" begin="17" end="17" resetval="0x0" description="Output Signal Latched Flag Clear" range="17" rwaccess="RW"/> 
		<bitfield id="BIT16" width="1" begin="16" end="16" resetval="0x0" description="Output Signal Latched Flag Clear" range="16" rwaccess="RW"/> 
		<bitfield id="BIT15" width="1" begin="15" end="15" resetval="0x0" description="Output Signal Latched Flag Clear" range="15" rwaccess="RW"/> 
		<bitfield id="BIT14" width="1" begin="14" end="14" resetval="0x0" description="Output Signal Latched Flag Clear" range="14" rwaccess="RW"/> 
		<bitfield id="BIT13" width="1" begin="13" end="13" resetval="0x0" description="Output Signal Latched Flag Clear" range="13" rwaccess="RW"/> 
		<bitfield id="BIT12" width="1" begin="12" end="12" resetval="0x0" description="Output Signal Latched Flag Clear" range="12" rwaccess="RW"/> 
		<bitfield id="BIT11" width="1" begin="11" end="11" resetval="0x0" description="Output Signal Latched Flag Clear" range="11" rwaccess="RW"/> 
		<bitfield id="BIT10" width="1" begin="10" end="10" resetval="0x0" description="Output Signal Latched Flag Clear" range="10" rwaccess="RW"/> 
		<bitfield id="BIT9" width="1" begin="9" end="9" resetval="0x0" description="Output Signal Latched Flag Clear" range="9" rwaccess="RW"/> 
		<bitfield id="BIT8" width="1" begin="8" end="8" resetval="0x0" description="Output Signal Latched Flag Clear" range="8" rwaccess="RW"/> 
		<bitfield id="BIT7" width="1" begin="7" end="7" resetval="0x0" description="Output Signal Latched Flag Clear" range="7" rwaccess="RW"/> 
		<bitfield id="BIT6" width="1" begin="6" end="6" resetval="0x0" description="Output Signal Latched Flag Clear" range="6" rwaccess="RW"/> 
		<bitfield id="BIT5" width="1" begin="5" end="5" resetval="0x0" description="Output Signal Latched Flag Clear" range="5" rwaccess="RW"/> 
		<bitfield id="BIT4" width="1" begin="4" end="4" resetval="0x0" description="Output Signal Latched Flag Clear" range="4" rwaccess="RW"/> 
		<bitfield id="BIT3" width="1" begin="3" end="3" resetval="0x0" description="Output Signal Latched Flag Clear" range="3" rwaccess="RW"/> 
		<bitfield id="BIT2" width="1" begin="2" end="2" resetval="0x0" description="Output Signal Latched Flag Clear" range="2" rwaccess="RW"/> 
		<bitfield id="BIT1" width="1" begin="1" end="1" resetval="0x0" description="Output Signal Latched Flag Clear" range="1" rwaccess="RW"/> 
		<bitfield id="BIT0" width="1" begin="0" end="0" resetval="0x0" description="Output Signal Latched Flag Clear" range="0" rwaccess="RW"/>
	</register>
