IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_PWMXBAR_CONTROLSS_PWMXBAR.xml
	<register id="CONTROLSS_PWMXBAR_PWMXBAR26_G0" acronym="CONTROLSS_PWMXBAR_PWMXBAR26_G0" offset="0x780" width="24" description="">
		<bitfield id="SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBar26 G0 Input Select0: CMP12SS0.CTRIPL1: CMP12SS0.CTRIPH2: CMP12SS1.CTRIPL3: CMP12SS1.CTRIPH4: CMP12SS2.CTRIPL5: CMP12SS2.CTRIPH6: CMP12SS3.CTRIPL7: CMP12SS3.CTRIPH8: CMP12SS4.CTRIPL9: CMP12SS4.CTRIPH10: CMP12SS5.CTRIPL11: CMP12SS5.CTRIPH12: CMP12SS6.CTRIPL13: CMP12SS6.CTRIPH14: CMP12SS7.CTRIPL15: CMP12SS7.CTRIPH16: CMP12SS8.CTRIPL17: CMP12SS8.CTRIPH18: CMP12SS9.CTRIPL19: CMP12SS9.CTRIPH" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR26_G1" acronym="CONTROLSS_PWMXBAR_PWMXBAR26_G1" offset="0x784" width="24" description="">
		<bitfield id="SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBar26 G1 Input Select0: CMP8SS0.CTRIPL1: CMP8SS0.CTRIPH2: CMP8SS1.CTRIPL3: CMP8SS1.CTRIPH4: CMP8SS2.CTRIPL5: CMP8SS2.CTRIPH6: CMP8SS3.CTRIPL7: CMP8SS3.CTRIPH8: CMP8SS4.CTRIPL9: CMP8SS4.CTRIPH10: CMP8SS5.CTRIPL11: CMP8SS5.CTRIPH12: CMP8SS6.CTRIPL13: CMP8SS6.CTRIPH14: CMP8SS7.CTRIPL15: CMP8SS7.CTRIPH16: CMP8SS8.CTRIPL17: CMP8SS8.CTRIPH18: CMP8SS9.CTRIPL19: CMP8SS9.CTRIPH" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR26_G2" acronym="CONTROLSS_PWMXBAR_PWMXBAR26_G2" offset="0x788" width="24" description="">
		<bitfield id="SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBar26 G2 Input Select0: SDFM0.FILT1CEVT11: SDFM0.FILT1CEVT22: SDFM0.FILT1COMPHZ3: SDFM0.FILT2CEVT14: SDFM0.FILT2CEVT25: SDFM0.FILT2COMPHZ6: SDFM0.FILT3CEVT17: SDFM0.FILT3CEVT28: SDFM0.FILT3COMPHZ9: SDFM0.FILT4CEVT110: SDFM0.FILT4CEVT211: SDFM0.FILT4COMPHZ12: SDFM1.FILT1CEVT113: SDFM1.FILT1CEVT214: SDFM1.FILT1COMPHZ15: SDFM1.FILT2CEVT116: SDFM1.FILT2CEVT217: SDFM1.FILT2COMPHZ18: SDFM1.FILT3CEVT119: SDFM1.FILT3CEVT220: SDFM1.FILT3COMPHZ21: SDFM1.FILT4CEVT122: SDFM1.FILT4CEVT223: SDFM1.FILT4COMPHZ" range="23 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR26_G3" acronym="CONTROLSS_PWMXBAR_PWMXBAR26_G3" offset="0x78C" width="24" description="">
		<bitfield id="SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBar26 G3 Input Select1: ADC0.EVT22: ADC0.EVT33: ADC0.EVT44: ADC1.EVT15: ADC1.EVT26: ADC1.EVT37: ADC1.EVT48: ADC2.EVT19: ADC2.EVT210: ADC2.EVT311: ADC2.EVT412: ADC3.EVT113: ADC3.EVT214: ADC3.EVT315: ADC3.EVT416: ADC4.EVT117: ADC4.EVT218: ADC4.EVT319: ADC4.EVT4" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR26_G4" acronym="CONTROLSS_PWMXBAR_PWMXBAR26_G4" offset="0x790" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBar26 G4 input bit select. Input source is INPUT XBAR.1: INPUT XBAR output bit[x] selected0: INPUT XBAR output bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR26_G5" acronym="CONTROLSS_PWMXBAR_PWMXBAR26_G5" offset="0x794" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBar26 G5 input bit select. Input source is PWM TRIPOUT.1: PWM TRIPOUT bit[x] selected0: PWM TRIPOUT bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR26_G6" acronym="CONTROLSS_PWMXBAR_PWMXBAR26_G6" offset="0x798" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBar26 G6 input bit select. Input source is PWM DEL TRIP1: PWM DEL TRIP bit[x] selected0: PWM DEL TRIP bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR26_G7" acronym="CONTROLSS_PWMXBAR_PWMXBAR26_G7" offset="0x79C" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBar26 G7 input bit select. Input source is PWM DEL ACTIVE1: PWM DEL ACTIVE bit[x] selected0: PWM DEL ACTIVE bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR26_G8" acronym="CONTROLSS_PWMXBAR_PWMXBAR26_G8" offset="0x7A0" width="32" description="">
		<bitfield id="SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBar26 G8 Input Select0: EQEP0.ERR1: EQEP1.ERR2: EQEP2.ERR6:3: FSIRX0.RX_TRIG410:7: FSIRX1.RX_TRIG414:11: FSIRX2.RX_TRIG418:15: FSIRX3.RX_TRIG4  28:19: ECAP[9:0].TRIPOUT" range="28 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR27_G0" acronym="CONTROLSS_PWMXBAR_PWMXBAR27_G0" offset="0x7C0" width="24" description="">
		<bitfield id="SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBar27 G0 Input Select0: CMP12SS0.CTRIPL1: CMP12SS0.CTRIPH2: CMP12SS1.CTRIPL3: CMP12SS1.CTRIPH4: CMP12SS2.CTRIPL5: CMP12SS2.CTRIPH6: CMP12SS3.CTRIPL7: CMP12SS3.CTRIPH8: CMP12SS4.CTRIPL9: CMP12SS4.CTRIPH10: CMP12SS5.CTRIPL11: CMP12SS5.CTRIPH12: CMP12SS6.CTRIPL13: CMP12SS6.CTRIPH14: CMP12SS7.CTRIPL15: CMP12SS7.CTRIPH16: CMP12SS8.CTRIPL17: CMP12SS8.CTRIPH18: CMP12SS9.CTRIPL19: CMP12SS9.CTRIPH" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR27_G1" acronym="CONTROLSS_PWMXBAR_PWMXBAR27_G1" offset="0x7C4" width="24" description="">
		<bitfield id="SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBar27 G1 Input Select0: CMP8SS0.CTRIPL1: CMP8SS0.CTRIPH2: CMP8SS1.CTRIPL3: CMP8SS1.CTRIPH4: CMP8SS2.CTRIPL5: CMP8SS2.CTRIPH6: CMP8SS3.CTRIPL7: CMP8SS3.CTRIPH8: CMP8SS4.CTRIPL9: CMP8SS4.CTRIPH10: CMP8SS5.CTRIPL11: CMP8SS5.CTRIPH12: CMP8SS6.CTRIPL13: CMP8SS6.CTRIPH14: CMP8SS7.CTRIPL15: CMP8SS7.CTRIPH16: CMP8SS8.CTRIPL17: CMP8SS8.CTRIPH18: CMP8SS9.CTRIPL19: CMP8SS9.CTRIPH" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR27_G2" acronym="CONTROLSS_PWMXBAR_PWMXBAR27_G2" offset="0x7C8" width="24" description="">
		<bitfield id="SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBar27 G2 Input Select0: SDFM0.FILT1CEVT11: SDFM0.FILT1CEVT22: SDFM0.FILT1COMPHZ3: SDFM0.FILT2CEVT14: SDFM0.FILT2CEVT25: SDFM0.FILT2COMPHZ6: SDFM0.FILT3CEVT17: SDFM0.FILT3CEVT28: SDFM0.FILT3COMPHZ9: SDFM0.FILT4CEVT110: SDFM0.FILT4CEVT211: SDFM0.FILT4COMPHZ12: SDFM1.FILT1CEVT113: SDFM1.FILT1CEVT214: SDFM1.FILT1COMPHZ15: SDFM1.FILT2CEVT116: SDFM1.FILT2CEVT217: SDFM1.FILT2COMPHZ18: SDFM1.FILT3CEVT119: SDFM1.FILT3CEVT220: SDFM1.FILT3COMPHZ21: SDFM1.FILT4CEVT122: SDFM1.FILT4CEVT223: SDFM1.FILT4COMPHZ" range="23 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR27_G3" acronym="CONTROLSS_PWMXBAR_PWMXBAR27_G3" offset="0x7CC" width="24" description="">
		<bitfield id="SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBar27 G3 Input Select1: ADC0.EVT22: ADC0.EVT33: ADC0.EVT44: ADC1.EVT15: ADC1.EVT26: ADC1.EVT37: ADC1.EVT48: ADC2.EVT19: ADC2.EVT210: ADC2.EVT311: ADC2.EVT412: ADC3.EVT113: ADC3.EVT214: ADC3.EVT315: ADC3.EVT416: ADC4.EVT117: ADC4.EVT218: ADC4.EVT319: ADC4.EVT4" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR27_G4" acronym="CONTROLSS_PWMXBAR_PWMXBAR27_G4" offset="0x7D0" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBar27 G4 input bit select. Input source is INPUT XBAR.1: INPUT XBAR output bit[x] selected0: INPUT XBAR output bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR27_G5" acronym="CONTROLSS_PWMXBAR_PWMXBAR27_G5" offset="0x7D4" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBar27 G5 input bit select. Input source is PWM TRIPOUT.1: PWM TRIPOUT bit[x] selected0: PWM TRIPOUT bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR27_G6" acronym="CONTROLSS_PWMXBAR_PWMXBAR27_G6" offset="0x7D8" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBar27 G6 input bit select. Input source is PWM DEL TRIP1: PWM DEL TRIP bit[x] selected0: PWM DEL TRIP bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR27_G7" acronym="CONTROLSS_PWMXBAR_PWMXBAR27_G7" offset="0x7DC" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBar27 G7 input bit select. Input source is PWM DEL ACTIVE1: PWM DEL ACTIVE bit[x] selected0: PWM DEL ACTIVE bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR27_G8" acronym="CONTROLSS_PWMXBAR_PWMXBAR27_G8" offset="0x7E0" width="32" description="">
		<bitfield id="SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBar27 G8 Input Select0: EQEP0.ERR1: EQEP1.ERR2: EQEP2.ERR6:3: FSIRX0.RX_TRIG410:7: FSIRX1.RX_TRIG414:11: FSIRX2.RX_TRIG418:15: FSIRX3.RX_TRIG4  28:19: ECAP[9:0].TRIPOUT" range="28 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR28_G0" acronym="CONTROLSS_PWMXBAR_PWMXBAR28_G0" offset="0x800" width="24" description="">
		<bitfield id="SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBar28 G0 Input Select0: CMP12SS0.CTRIPL1: CMP12SS0.CTRIPH2: CMP12SS1.CTRIPL3: CMP12SS1.CTRIPH4: CMP12SS2.CTRIPL5: CMP12SS2.CTRIPH6: CMP12SS3.CTRIPL7: CMP12SS3.CTRIPH8: CMP12SS4.CTRIPL9: CMP12SS4.CTRIPH10: CMP12SS5.CTRIPL11: CMP12SS5.CTRIPH12: CMP12SS6.CTRIPL13: CMP12SS6.CTRIPH14: CMP12SS7.CTRIPL15: CMP12SS7.CTRIPH16: CMP12SS8.CTRIPL17: CMP12SS8.CTRIPH18: CMP12SS9.CTRIPL19: CMP12SS9.CTRIPH" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR28_G1" acronym="CONTROLSS_PWMXBAR_PWMXBAR28_G1" offset="0x804" width="24" description="">
		<bitfield id="SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBar28 G1 Input Select0: CMP8SS0.CTRIPL1: CMP8SS0.CTRIPH2: CMP8SS1.CTRIPL3: CMP8SS1.CTRIPH4: CMP8SS2.CTRIPL5: CMP8SS2.CTRIPH6: CMP8SS3.CTRIPL7: CMP8SS3.CTRIPH8: CMP8SS4.CTRIPL9: CMP8SS4.CTRIPH10: CMP8SS5.CTRIPL11: CMP8SS5.CTRIPH12: CMP8SS6.CTRIPL13: CMP8SS6.CTRIPH14: CMP8SS7.CTRIPL15: CMP8SS7.CTRIPH16: CMP8SS8.CTRIPL17: CMP8SS8.CTRIPH18: CMP8SS9.CTRIPL19: CMP8SS9.CTRIPH" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR28_G2" acronym="CONTROLSS_PWMXBAR_PWMXBAR28_G2" offset="0x808" width="24" description="">
		<bitfield id="SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBar28 G2 Input Select0: SDFM0.FILT1CEVT11: SDFM0.FILT1CEVT22: SDFM0.FILT1COMPHZ3: SDFM0.FILT2CEVT14: SDFM0.FILT2CEVT25: SDFM0.FILT2COMPHZ6: SDFM0.FILT3CEVT17: SDFM0.FILT3CEVT28: SDFM0.FILT3COMPHZ9: SDFM0.FILT4CEVT110: SDFM0.FILT4CEVT211: SDFM0.FILT4COMPHZ12: SDFM1.FILT1CEVT113: SDFM1.FILT1CEVT214: SDFM1.FILT1COMPHZ15: SDFM1.FILT2CEVT116: SDFM1.FILT2CEVT217: SDFM1.FILT2COMPHZ18: SDFM1.FILT3CEVT119: SDFM1.FILT3CEVT220: SDFM1.FILT3COMPHZ21: SDFM1.FILT4CEVT122: SDFM1.FILT4CEVT223: SDFM1.FILT4COMPHZ" range="23 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR28_G3" acronym="CONTROLSS_PWMXBAR_PWMXBAR28_G3" offset="0x80C" width="24" description="">
		<bitfield id="SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBar28 G3 Input Select1: ADC0.EVT22: ADC0.EVT33: ADC0.EVT44: ADC1.EVT15: ADC1.EVT26: ADC1.EVT37: ADC1.EVT48: ADC2.EVT19: ADC2.EVT210: ADC2.EVT311: ADC2.EVT412: ADC3.EVT113: ADC3.EVT214: ADC3.EVT315: ADC3.EVT416: ADC4.EVT117: ADC4.EVT218: ADC4.EVT319: ADC4.EVT4" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMXBAR_PWMXBAR28_G4" acronym="CONTROLSS_PWMXBAR_PWMXBAR28_G4" offset="0x810" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBar28 G4 input bit select. Input source is INPUT XBAR.1: INPUT XBAR output bit[x] selected0: INPUT XBAR output bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
